
# ============================================================
# مسیر یادگیری مهندس هوش مصنوعی (AI Engineer Journey)
# ============================================================
#
# شماره پروژه : 02
#
# نام پروژه : بازی حدس عدد مخفی
#
# نام فایل : project02_guess_game.py
#
# نویسنده : رضا وکیلی
#
# تاریخ ایجاد : 25 July 2026
#
# نسخه : 1.0
#
# ------------------------------------------------------------
# هدف پروژه
# ------------------------------------------------------------
#
# طراحی یک برنامه که از کاربر بخواهد
# عدد مخفی را حدس بزند.
#
# برنامه تا زمانی که عدد صحیح وارد نشود،
# به دریافت ورودی ادامه می‌دهد.
#
# اگر عدد کوچک‌تر باشد:
#     Too Low
#
# اگر عدد بزرگ‌تر باشد:
#     Too High
#
# پس از وارد کردن عدد صحیح:
#     Congratulations!
#
# ------------------------------------------------------------
# مفاهیم استفاده شده
# ------------------------------------------------------------
#
# • متغیرها (Variables)
# • دریافت ورودی (Input)
# • چاپ خروجی (Output)
# • حلقه while
# • دستور if / else
# • عملگرهای مقایسه
#
# ------------------------------------------------------------
# هدف آموزشی
# ------------------------------------------------------------
#
# • یادگیری حلقه While
# • درک شرط ادامه و پایان حلقه
# • جلوگیری از ایجاد حلقه بی‌نهایت
# • تقویت مهارت حل مسئله
#
# ============================================================
print("Welcome to Guess Game")
secret=int(input("Guess the number:"))

while secret != 7:
    
    if secret < 7:
       print("Too Low") 
    else:
       print("Too High")

    secret=int(input("Guess the number:"))     
    print("Congratulations!")


    # ============================================================
# پایان پروژه شماره 02
# ------------------------------------------------------------
#
# وضعیت پروژه :
# با موفقیت تکمیل شد.
#
# مهارت‌های کسب شده :
# ✓ استفاده از حلقه While
# ✓ دریافت ورودی درون حلقه
# ✓ تصمیم‌گیری با if / else
# ✓ تحلیل و رفع خطاهای منطقی
#
# Git :
# ✓ Commit انجام شد.
# ✓ Push انجام شد.
#
# مسیر یادگیری مهندس هوش مصنوعی
# AI Engineer Journey
#
# ============================================================



