
# ======================================================
# پروژه شماره 03
#
# نام پروژه:
# چاپ الگوی مثلث کامل با استفاده از دو حلقه For
#
# هدف:
# آشنایی با استفاده از دو حلقه For برای چاپ
# الگوهای متقارن و ترکیب چند حلقه در یک برنامه
#
# ورودی:
# ندارد
#
# خروجی:
#
# *
# **
# ***
# ****
# *****
# ****
# ***
# **
# *
#
# مفاهیم استفاده شده:
# - For Loop
# - range()
# - حرکت افزایشی
# - حرکت کاهشی
# - ضرب رشته در عدد
#
# نویسنده:
# رضا وکیلی
#
# دوره:
# AI Engineer Journey
# ======================================================

for i in range(1, 6):
    print("*" * i)

for i in range(4, 0, -1):
    print("*" * i)

# ======================================================
# پایان پروژه شماره 03
#
# نتیجه:
# در این پروژه با استفاده از دو حلقه For،
# ابتدا نیمه بالایی و سپس نیمه پایینی الگو
# چاپ شد. این تمرین نشان می‌دهد که چگونه
# می‌توان چند حلقه را برای تولید الگوهای
# متقارن و پیچیده‌تر با یکدیگر ترکیب کرد.
# ======================================================