
# ============================================
# Project 05 : String Slicing Pattern
# هدف:
# آشنایی با String Slicing و چاپ الگو با استفاده از برش رشته
# ============================================


text = "54321"

for i in range(5, 0 , -1):
      print(text[0:i])


# ============================================
# توضیح:
# در این پروژه از String Slicing برای چاپ تدریجی
# بخش‌های مختلف یک رشته استفاده شده است.
#
# text[0:i]
# یعنی از اندیس 0 تا قبل از اندیس i چاپ کن.
#
# خروجی:
# 54321
# 5432
# 543
# 54
# 5
#
# مهارت‌های استفاده‌شده:
# - For Loop
# - Reverse Loop
# - String Slicing
# ============================================