
# ======================================================
# پروژه شماره 04
#
# نام پروژه:
# چاپ مثلث معکوس با استفاده از حلقه For
#
# هدف:
# آشنایی با حلقه For، تابع range و چاپ الگوها
#
# ورودی:
# ندارد
#
# خروجی:
# *****
# ****
# ***
# **
# *
#
# نویسنده:
# رضا وکیلی
#
# دوره:
# AI Engineer Journey
# ======================================================


for i in range(5, 0, -1):
    print("*" * i)


# ======================================================
# پایان پروژه شماره 04
#
# نتیجه:
# در این پروژه نحوه استفاده از حلقه For با گام منفی
# و چاپ الگوهای ستاره‌ای تمرین شد.
# ======================================================